{
  "intro": {
    "title": "My Journey",
    "content": "Welcome to my story! Here's a glimpse into my professional journey and the experiences that have shaped who I am today.",
    "image": null
  },
  "experiences": [
    {
      "id": "exp-1",
      "title": "Software Engineer – AWS AI Science Team",
      "period": "2024",
      "story": "My first experience building a WebAgent — learning how to design, train, and evaluate it within a large-scale system at Amazon AI. This was where the idea of scalable agent reasoning truly began to take shape.",
      "highlights": [
        "Agent Playground Productization",
        "Agent Avail Flywheel",
        "Benchmark-Grade Fidelity"
      ],
      "image": null
    },
    {
      "id": "exp-2",
      "title": "AI Product Engineer – PingAn AI Lab",
      "period": "2023",
      "story": "My first role in fintech, working with a computer vision team to develop a multimodal fraud detection system that combined AI infrastructure and business impact.",
      "highlights": [
        "AI Fraud Platformization",
        "Collaborated with CV and NLP scientists to build risk signal expansion"
      ],
      "image": null
    },
    {
      "id": "exp-3",
      "title": "Product Manager – Tencent Ads",
      "period": "2021",
      "story": "Worked on embedding-based collaborative models to improve ad targeting and multi-objective optimization across Tencent's advertising platform.",
      "highlights": [
        "Deployed embedding collaborative models for ad relevance optimization",
        "Enhanced CTR-ROI balance through multi-objective modeling",
        "Drove cross-team iteration between algorithm and UX groups"
      ],
      "image": null
    },
    {
      "id": "exp-4",
      "title": "Product Analytics Scientist – ByteDance",
      "period": "2021",
      "story": "Built the first commercial analytics dashboard for TikTok's monetization team, transforming fragmented data into real-time business insight.",
      "highlights": [
        "Developed end-to-end BI diagnostic dashboard for large-scale ad analytics",
        "Streamlined data pipelines enabling real-time performance visualization",
        "Enabled data-driven monetization decisions for Douyin Ads"
      ],
      "image": null
    }
  ],
  "education": [
    {
      "id": "edu-1",
      "title": "Master of Science in Information Systems",
      "institution": "Northeastern University",
      "period": "2023 – 2025 · Oakland, CA",
      "story": "Focused on building intelligent systems at the intersection of software engineering and AI. Courses include Machine Learning, Advanced LLM, Data Science, and Full-Stack Web Development.",
      "achievements": "Graduate Teaching Assistant for Data Science & Career Management courses",
      "image": null
    },
    {
      "id": "edu-2",
      "title": "Master of Science in Education",
      "institution": "The Johns Hopkins University",
      "period": "2021 – 2022 · Baltimore, MD",
      "story": "Explored human–computer interaction, cognitive psychology, and experimental design — a foundation that continues to influence how I think about AI and user experience.",
      "achievements": "Research focus on cognitive modeling and interaction design",
      "image": null
    }
  ]
}
